Map<String, String> arAE = {
  //Common
  'days': 'اليوم',
  'awesome': 'رائع',
  'save': 'حفظ',
  'apple': 'أبل', //@
  'cancel': 'إلغاء', //@
  'profile': 'حسابي', //@
  'help': 'مساعدة', //@
  'explore': 'اكتشفي', //@
  'today': 'اليوم', //@
  'app_settings': 'إعدادات التطبيق', //@
  'saved': 'العناصر المحفوظة', //@
  'next': 'التالي', //@
  'terms': ' شروط ', //@
  'and': ' و ', //@
  'finish': 'إكمال التسجيل', //@
  'i\'m_not_sure': 'لست واثق',
  'skip': 'يتخطى',
  'settings': 'إعدادات', //@
  '0_tasks': '0 مهام',
  'english': 'عربي',
  'get_started': 'بدء استخدام •OVU', //@
  'privacy_policy': 'أحكام الاستخدام', //@
  'sent_to': 'أرسلنا الكود إلى', //@
  'resend_code': 'إعادة إرسال الكود', //@
  'first_name': 'الاسم الاول', //@
  'maybe_later': 'لاحقا', //@
  'allow_notifications': 'تشغيل الاشعارات', //@
  //Authorize screen @
  'use_as_guest': 'تسجيل الدخول لاحقا',
  'authorize_with_google': 'تسجيل الدخول بواسطة جوجل',
  'authorize_with_apple': 'تسجيل الدخول بواسطة أبل',
  'continue_with_phone_no': 'الدخول برقم الجوّال',
  //Mobile LogIn 1 Screen @
  'enter_your_phone_numbert': 'اكتبي رقم جوّالك',
  'we_will_text_you_a_verification_code': 'سنقوم بارسال كود التحقق لهذا الرقم',
  'by_continuing_you_agree_to_our': 'بالضغط على التالي فأنت توافقين على',
  //Mobile LogIn confermation @
  'enter_verification_code': 'اكتبي كود التحقق',
  //Mobile LogIn Name @
  'what_is_your_first_name_?': 'ما اسمك اﻷول؟',
  'so_we_know_what_to_call_you': 'نحتاج الاسم لنعرف كيف نناديكي',
  //Notification Screen @
  'cycle_reminders': 'تذكيرات بالدورة',
  'allow_OVU._to_help_you_keep_track_of_your':
      'اسمحي لـ•OVU بمساعدتك على متابعة',
  'health_and_well-being_by_sending_timely':
      'صحتك ورفاهيتك من خلال إرسال النصائح والتذكيرات',
  'tips_and_reminders-being_by_sending_timely':
      'في الأوقات المناسبة بناء على معلوماتك',
  //Birthday Screen
  'last_period_starting_date': 'تاريخ بدء الفترة الأخيرة',
  'select_“I\'m_not_sure”_if_you_don\'t_remember':
      'حدد "لست متأكدًا" إذا كنت لا تتذكر',
  'birthday_title': 'أضيفي تاريخ ميلادك لجعل توقعات الدورة أكثر دقة', //@
  'log_your_birth_date_to_make': 'سجل تاريخ ميلادك لجعله',
  'predections_better': 'تنبؤات أفضل',
  //Completed Screen @
  'second_badge': 'لقد حصلت على شارتك الثانية',
  'start_my_journey': 'ابدئي رحلتك',
  'keep_using_and_invite_your': 'نحن سعداء للغاية بوجودك!',
  'friends_to_earn_more_badges': 'قومي بدعوة أصدقائك لربح المزيد من الأوسمة',
  //Cycle Type Screen
  'is_your_menstural_cycle_regular_?': 'هل دورتك الشهرية منتظمة؟',
  '(regular:_not_more_than_7_days)': '(عادي: ليس أكثر من 7 أيام)',
  'regular_cycle': 'دورة منتظمة',
  'irregular_cycle': 'دورة غير منتظمة',
  //Symptoms Screen
  'symptoms_you\'re_experiencing': 'الأعراض التي تعاني منها',
  'you_can_choose_multiple': 'يمكنك اختيار متعددة',
  'painful_cramps': 'تشنجات مؤلمة',
  'PMS_ymptoms': 'أعراض الدورة الشهرية',
  'heavy_menstrual_flow': 'تدفق الحيض الثقيل',
  'mood_swings': 'تقلب المزاج',
  'Other(s)': 'آخرون',
  'nothing_bothers_me': 'لا شيء يزعجني',
  //Flow Type Screen
  'your_menstrual_flow type': 'نوع تدفق الحيض الخاص بك',
  'what_type_of_flows_you_notice_more': 'ما نوع التدفقات التي تلاحظها أكثر',
  'light_flow': 'تدفق الضوء',
  'medium_flow': 'التدفق المتوسط',
  'heavy_flow': 'تدفق كثيف',
  // Badge Screen
  'you_earned_your_first_badge': 'لقد ربحت شارتك الأولى',
  'keep_using_OVU._and_invite_your_friends_to_earn_more_badges':
      'استمر في استخدام OVU. ودعوة' + 'أصدقائك لكسب المزيد من الشارات',
  //Guest Screen @
  'invite_my_friends': 'ادعُ أصدقائك',
  'my_stuff': 'أشيائي',
  'to_get_done': 'مهماتي اليومية',
  'my_moods': 'بيانات المزاج',
  'my_journals': 'مدوناتي',
  'cycle_history': 'تاريخ الدورة',
  'change_language': 'تغيير اللغة',
  'contact': 'كوني على تواصل',
  'need_help': 'مساعدة لاستخدام التطبيق',
  'helpful_qustions': 'أسئلة متكررة',
  'rate_our_app': 'قيّمي التطبيق لو عجبك',
  'Invite_friend': 'دعوات الأصدقاء لمزيد من الجوائز',
  //Edit Profile Screen @
  'edit_Profile': 'تعديل الملف الشخصي',
  'yara': 'يارا',
  'mobile_no': 'رقم الجوال',
  'connected_accounts': 'الحسابات المتصلة',
  'google': 'جوجل',
  'connected': 'متصل',
  'other': 'أخرى', //@
  //Help Screen
  'Symptoms_experiencing': 'الأعراض التي تعاني منها',
  'multiple_options': 'يمكنك اختيار عدة خيارات',
  'cramps': 'تشنجات',
  'skin_changes': 'تغيرات الجلد',
  'breast_tenderness': 'حنان الثدي',
  'sleeping_issues': 'مشاكل النوم',
  'crying': 'بكاء',
  'fatigue': 'إعياء',
  'food_cravings': 'الرغبة الشديدة في تناول الطعام',
  'headache': 'صداع الراس',
  'poor_concentration': 'تركيز ضعيف',
  'social_withdrawal': 'الانسحاب الاجتماعي',
  'physical_pain': 'ألم جسدي',
  'bowel_issues': 'مشاكل الأمعاء',
  'show_suggestions': 'إظهار اقتراحات',
  'talk_to_specialist': 'تحدث إلى أخصائي',
  //Today Screen
  'period_in': 'الدورة القادمة في',
  'log_Period': 'تسجيل الدورة',
  '6_days': '6 أيام',
  'today_first_task': '  مهمة اليوم الأولى',
  'view_full_calendar': 'عــرض الأجـــندة',
  //Explore Screen
  'hint_search': 'أبحث عن...',
  'help_me': 'مساعدة',
  'video': 'ڤيديو',
  'period_cramp': 'كيف أتعامل مع التقلصات 🩸',
  'article': 'تدوينة',
  'yoga_poses': 'خمسة وضعيات للـيوجا لتخفيف الألـم 🧘‍',
  'happier_period': 'كيف تحصلين على دورة شهرية أكثر سعادة ؟ 🍒',
  'track_your':
      'لماذا نعتقد أنه يجب عليك استخدام تطبيق لتتبع الدورة الشهرية! 📱',
  'small_happiness': 'السعادات الصغيرة ✨',
  'girl_lifestyle': 'ماذا أكلت في أسبوع الدورة؟ 🥑',
  'sleep_remedy': 'أفضل علاج للنوم 💜',
  'period_beach': 'مجموعة الشواطئ والسفر الخاصة بالدورة الشهرية ⛱',
  'sec': '٣٠ ثانية',
  'min': '٣ دقائق قراءة',
  'min2': 'دقيقتين قراءة',
  'min3': 'دقيقة قراءة',
  //Tasks Screen
  'list': 'قائمة',
  'calendar': 'تقويم',
  'new task': 'مهمة جديدة',
  'what_would_you_like_to_do': 'ماذا تريد ان تفعل؟',
  //Tasks List Screen
  'clean_room': 'نظف غرفتي',
  'call_sarah': 'اتصل بسارة',
  'travel_to_grandma!': 'السفر إلى الجدة!',
  'finish_school': 'إنهاء مهمة المدرسة',
  'completed': 'مكتمل',
  'yesterday': 'في الامس',
  //Tasks Calender Screen
  'my_tasks': 'مهامي',
  'my_emotion': 'مشاعري 😭',
  'there_are_many_variations':
      'هناك العديد من الأنواع المتوفرة لنصوص لوريم إيبسوم ...',
  'my_cycle': 'دورتي',
  'You_felt_good': '4 • شعرت بالرضا',
  'cramps_mood_swings': 'تقلصات ، تقلبات مزاجية ، ألم الثدي',
  'view_full_details': 'عرض التفاصيل الكاملة',
  //edit_able Screen @
  'select_the_mood': 'حددي حالتك المزاجية التي تشعرين بها', //@
  'Select_all_the_symptoms': 'اختاري كل الأعراض التي مررت بيها خلال الدورة', //@
  'estimate_your_average': 'مقدار تدفق الدم خلال أيام الدورة', //@
  'travel': 'سفر', //@
  'high_activity': 'نشاط جسدي عالي', //@
  'add_note': 'ملاحظتِك', //@
  'save_my_log': 'إضافة الدورة', //@
  //My Badges Screen
  'created_Profile': 'إنشاء ملف تعريف',
  'of_cycle_info': '100٪ من معلومات الدورة',
  'Invite_friends': 'ادعُ 5 أصدقاء',
  'log_cycles': 'سجل 5 دورات',
  'mood_check-in': '365 حالة مزاجية تحقق',
  'Invite_10_friends': 'ادعُ 10 أصدقاء',
  'write 10 journals': 'كتابة 10 مجلات',
  'done_tasks': '10 مهام منتهية',
  'save_videos': 'حفظ 10 مقاطع فيديو',
  'earn_more_badges':
      'استمر في استخدام OVU • وادعو أصدقائك لكسب المزيد من الشارات',
  //Helpful Qustions Screen
  'know_about': 'اريد ان اعرف ...',
  'tracking_app': 'ما هو تطبيق تتبع الدورة الشهرية؟',
  'menstrual_cycle_tracker':
      'تطبيق تتبع الدورة الشهرية هو أداة لمساعدة البنات من سن ١٢ سنة على متابعة دوراتهم الشهرية وإدارة صحتهم الإنجابية. باستخدام التطبيق، يمكنك تسجيل الدورة الشهرية ومتابعة الأعراض والعناية بنفسك، بالاضافة إلى الوصول إلى مجموعة متنوعة من المصادر والميزات التي تساعدهم في العناية بصحتك.',
  'should_i_use': 'لماذا يجب علي أن أستخدم تطبيق تتبع الدورة الشهرية؟',
  'should_i_use_answare':
      'هناك العديد من الفوائد المتعلقة باستخدام تطبيقات متابعة الدورة. من خلال تسجيل دوراتك الشهرية في التطبيق، يمكنك الحصول على فهم أفضل لدورتك والتعرف على صحتك الإنجابية. يمكنك أيضًا استخدام التطبيق لمتابعة الأعراض وأنشطة العناية بنفسك والحصول على توصيات مخصصة بناءً على بياناتك. كما يمكن للتطبيق المساعدة في الربط بينك وبين مستخدمين ومصادر أخرى للدعم في هذه الـمرحلة.',
  //Terms Conditions Screen
  'terms_conditions': 'الشروط والأحكام',
  'welcome_to': 'مرحبًا بك في OVU •',
  'these_terms_and_conditions':
      'تحكم هذه الشروط والأحكام ("الشروط") وصولك واستخدامك لتطبيقنا وموقعنا الإلكتروني وخدماتنا (يشار إليها مجتمعة باسم "الخدمات"). يرجى قراءة هذه الشروط بعناية قبل استخدام الخدمات. من خلال الوصول إلى الخدمات أو استخدامها ، فإنك توافق على الالتزام بهذه الشروط وسياسة الخصوصية الخاصة بنا. إذا كنت لا توافق على هذه الشروط ، فأنت غير مصرح لك بالوصول إلى الخدمات أو استخدامها.',
  'eligibility': 'أهلية',
  'to_use_the_services':
      'لاستخدام الخدمات ، يجب أن يكون عمرك 13 عامًا على الأقل ولديك الأهلية القانونية لإبرام عقد ملزم. إذا كنت تحت سن الرشد في ولايتك القضائية ، فلا يجوز لك استخدام الخدمات إلا بمشاركة وموافقة أحد الوالدين أو الوصي القانوني.',
  'account_registration': 'تسجيل الحساب والأمان',
  'to_use_certain_features':
      'لاستخدام ميزات معينة للخدمات ، ستحتاج إلى التسجيل للحصول على حساب وتقديم معلومات شخصية معينة. أنت مسؤول عن الحفاظ على سرية معلومات تسجيل الدخول إلى حسابك وعن جميع الأنشطة التي تحدث ضمن حسابك. إذا كنت تشك في أي استخدام غير مصرح به لحسابك ، فيجب عليك إخطارنا على الفور. لن نكون مسؤولين عن أي خسارة أو ضرر ناجم عن عدم امتثالك لهذا الحكم.',
  'use_services': 'استخدام الخدمات',
  'the_services_are':
      '(أ) الخدمات مخصصة للاستخدام الشخصي غير التجاري فقط. لا يجوز لك استخدام الخدمات لأي غرض غير قانوني أو غير مصرح به ، أو بأي طريقة يمكن أن تلحق الضرر بالخدمات أو تعطلها أو تثقل كاهلها أو تضعفها أو تتداخل مع استخدام أي طرف آخر للخدمات والتمتع بها. (ب) لا يجوز لك نسخ أي جزء من الخدمات أو تعديله أو توزيعه أو بيعه أو تأجيره ، ولا يجوز لك إجراء هندسة عكسية أو محاولة استخراج التعليمات البرمجية المصدر للبرنامج الأساسي للخدمات. (ج) لا يجوز لك استخدام أي وسائل آلية ، مثل الروبوتات أو برامج الكشط أو العناكب ، للوصول إلى الخدمات أو استخدامها ، أو لجمع محتوى أو معلومات من الخدمات. (د) لا يجوز لك استخدام الخدمات لنقل أي فيروسات أو فيروسات متنقلة أو برامج ضارة أخرى ، أو لإرسال أي بريد عشوائي أو رسائل غير مرغوب فيها.',
  'intellectual_property': 'الملكية الفكرية',
  'the_services_and':
      '(أ) الخدمات وجميع المحتويات والمواد المضمنة في الخدمات ، بما في ذلك على سبيل المثال لا الحصر النصوص والرسومات والشعارات والصور والبرامج ، هي ملك لشركة [اسم الشركة] أو المرخصين لها وهي محمية بموجب قوانين حقوق النشر والعلامات التجارية . (ب) لا يجوز لك استخدام أي محتوى أو مواد على الخدمات لأي غرض تجاري دون موافقة كتابية صريحة من OVU •.',
  'disclaimer_of_warranties': 'التنصل من الضمانات',
  'we_make_no_warranties':
      '(أ) يتم تقديم الخدمات على أساس "كما هي" و "حسب توفرها". نحن لا نقدم أي ضمانات ، صريحة أو ضمنية ، فيما يتعلق بالخدمات أو أي محتوى أو مواد على الخدمات. (ب) نحن لا نضمن عدم انقطاع الخدمات أو خلوها من الأخطاء ، ولن نكون مسؤولين عن أي انقطاعات أو أخطاء. (ج) نحن لا نؤيد أو نتحمل أي مسؤولية عن أي محتوى أو منتجات أو خدمات تقدمها أطراف ثالثة من خلال الخدمات. أي تفاعلات أو معاملات تجريها مع هذه الأطراف الثالثة تكون على مسؤوليتك الخاصة.',
  'indemnification': 'التعويض',
  'you_agree_to':
      'أنت توافق على تعويض [اسم الشركة] والشركات التابعة لها والمسؤولين والوكلاء والموظفين وإبعادهم عن أي مطالبة أو طلب ، بما في ذلك أتعاب المحاماة المعقولة التي يقدمها أي طرف ثالث بسبب استخدامك للخدمات أو ناشئة عنه ، انتهاكك لهذه الشروط ، أو انتهاكك لأي حقوق للآخرين.',
  'termination': 'نهاية',
  'we_reserve_the':
      'نحن نحتفظ بالحق ، وفقًا لتقديرنا الخاص ، في إنهاء أو تعليق وصولك إلى الخدمات في أي وقت ولأي سبب دون إشعار أو مسؤولية. عند إنهاء وصولك إلى الخدمات ، ستظل هذه الشروط سارية.',
  //Settings Screen
  'syncing_options': 'خيارات المزامنة',
  'apple_health': 'صحة التفاح',
  'notifications': 'إشعارات',
  'pms': 'الدورة الشهرية',
  'period': 'فترة',
  'symptoms_reminder': 'تذكير الأعراض',
  'mood_check_reminder': 'تذكير بفحص الحالة المزاجية',
  'journaling_reminder': 'يوميات تذكير',
  'due_date_for_tasks': 'موعد استحقاق المهام',
  //Modal Sheets
  'yours': 'خاصة بك',
  'mood_check_in': 'الحالة المزاجية',
  'mood_check_in_desc':
      'إضافة حالتك المزاجية عند تغيرها يساعدنا على توقع تغير مزاجك بدقة لتقديم اقتراحات مناسبة خلال أيام الدورة',
  'new_journal': 'صفحة اليوميات',
  'new_journal_desc':
      'تساعدك كتابة مشاعرك وأفكارك على تنظيمها وفهم نفسك... تمتعي بالخصوصية الكاملة، كل ما تكتبينه لا يظهر إلا لكِ فقط',
  'new_task': 'مهمة جديدة',
  'new_task_desc':
      'تساعدك قائمة المهام على تنظيم مهامك اليومية وتمنحك رؤية واضحة ليوم خالٍ من التوتر... سنساعدك على جعل قائمتك مرنة مع دورتك الشهرية',
  //New

  //Profile Screen
  'my_badges': 'شاراتي',
  'created': 'إنشاء ',

//Journals Screen
  'daily_reflection': 'انعكاس يومي',
  'there_are_many_variations_of_passages':
      'هناك العديد من الأنواع المتوفرة لنصوص لوريم إيبسوم ...',
  'september': 'سبتمبر',
//Cycle History Screen
  'add_your_period': 'إضافة الدورة الشهرية', //@
  'cycle_analytics': 'تحليلات الدورة',
  'period_length': 'طول الفترة',
  'mood': 'الحالة المزاجية:', //@
  'symptoms': 'الأعراض:', //@
  'menstrual_flow': 'تدفق الدم:', //@
  'note': 'ملحوظة:',
  'cramps_mood_swings_Breast_tenderness':
      'Cramps, Mood swings, Breast tenderness',
  'you_felt_good': '4 • شعرت بالرضا',
  'travel_high_activity': 'سفر ، نشاط جسدي عالي', //@
  'all_went_well': 'كل شيء يسير على ما يرام', //@
};
